IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_cpu2_sys_regs.xml
<module id="CPU2_SYS_REGS" HW_revision="" description="CPU2 SYS Registers">
	<register id="CPUSYSLOCK1" width="32" page="1" offset="0x0" internal="0" description="Lock bit for CPUSYS registers">
		<bitfield id="PIEVERRADDR" description="Lock bit for PIEVERRADDR Register" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR0" description="Lock bit for PCLKCR0 Register" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR1" description="Lock bit for PCLKCR1 Register" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR2" description="Lock bit for PCLKCR2 Register" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR3" description="Lock bit for PCLKCR3 Register" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR4" description="Lock bit for PCLKCR4 Register" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR6" description="Lock bit for PCLKCR6 Register" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR7" description="Lock bit for PCLKCR7 Register" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR8" description="Lock bit for PCLKCR8 Register" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR9" description="Lock bit for PCLKCR9 Register" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR10" description="Lock bit for PCLKCR10 Register" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR11" description="Lock bit for PCLKCR11 Register" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR13" description="Lock bit for PCLKCR13 Register" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR14" description="Lock bit for PCLKCR14 Register" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR16" description="Lock bit for PCLKCR16 Register" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="LPMCR" description="Lock bit for LPMCR Register" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIOLPMSEL0" description="Lock bit for GPIOLPMSEL0 Register" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIOLPMSEL1" description="Lock bit for GPIOLPMSEL1 Register" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR17" description="Lock bit for PCLKCR17 Register" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR18" description="Lock bit for PCLKCR18 Register" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR19" description="Lock bit for PCLKCR19 Register" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR21" description="Lock bit for PCLKCR21 Register" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR22" description="Lock bit for PCLKCR22 Register" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR23" description="Lock bit for PCLKCR23 Register" begin="30" end="30" width="1" rwaccess="RW"/>
	</register>
	<register id="CPUSYSLOCK2" width="32" page="1" offset="0x2" internal="0" description="Lock bit for CPUSYS registers">
		<bitfield id="ETHERCATCTL" description="Lock bit for ETHERCATCTL register" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR25" description="Lock bit for PCLKCR25 Register" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR26" description="Lock bit for PCLKCR26 Register" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR27" description="Lock bit for PCLKCR27 Register" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="LSEN" description="Lock bit for LSEN Register" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CMPSSLPMSEL" description="Lock bit for CMPSSLPMSEL register" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="PCLKCR28" description="Lock bit for PCLKCR28 Register" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="USER_REG1_SYSRSn" description="Lock bit for USER_REG1_SYSRSn" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="USER_REG2_SYSRSn" description="Lock bit for USER_REG2_SYSRSn" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="USER_REG1_XRSn" description="Lock bit for USER_REG1_XRSn" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="USER_REG2_XRSn" description="Lock bit for USER_REG2_XRSn" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="USER_REG1_PORESETn" description="Lock bit for USER_REG1_PORESETn" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="USER_REG2_PORESETn" description="Lock bit for USER_REG2_PORESETn" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="USER_REG3_PORESETn" description="Lock bit for USER_REG3_PORESETn" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="USER_REG4_PORESETn" description="Lock bit for USER_REG4_PORESETn" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="PIEVERRADDR" width="32" page="1" offset="0xa" internal="0" description="PIE Vector Fetch Error Address register">
		<bitfield id="ADDR" description="PIE Vector Fetch Error Handler Routine Address" begin="21" end="0" width="22" rwaccess="RW"/>
	</register>
	<register id="ETHERCATCTL" width="32" page="1" offset="0xc" internal="0" description="ETHERCAT control register.">
		<bitfield id="I2CLOOPBACK" description="Loopback I2C port of etherCAT IP to I2C_A." begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR0" width="32" page="1" offset="0x10" internal="0" description="Peripheral Clock Gating Registers">
		<bitfield id="CLA1" description="CLA1 Clock Enable Bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="DMA" description="DMA Clock Enable bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CPUTIMER0" description="CPUTIMER0 Clock Enable bit" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CPUTIMER1" description="CPUTIMER1 Clock Enable bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CPUTIMER2" description="CPUTIMER2 Clock Enable bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CPUBGCRC" description="CPUBGCRC Clock Enable Bit" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="CLA1BGCRC" description="CLA1BGCRC Clock Enable Bit" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="TBCLKSYNC" description="EPWM Time Base Clock sync" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GTBCLKSYNC" description="EPWM Time Base Clock Global sync" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="ERAD" description="ERAD module clock enable" begin="24" end="24" width="1" rwaccess="RW"/>
	</register>
	<register id="PCLKCR1" width="32" page="1" offset="0x12" internal="0" description="Peripheral Clock Gating Register - EMIF">
		<bitfield id="EMIF1" description="EMIF1 Clock Enable bit" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
